Autodesk.Revit.DB.DeleteElements.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})
Creates an instance of the DeleteElements resolution.
document:
The document which owns the elements to delete.
ids:
The ids of the elements that will be deleted when this resolution is chosen.
Returns:
The instance of the DeleteElements resolution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input ids is empty or contains an invalid element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011